<?php
	class A{
		function __call($name, $params){
			echo "Методу по імені $name не існує $params[0].<br>";
		}
	}

	$o = new A();
	$o->foo(555,2);
	//першим параметром передається ім'я неіснуючого методу,
	//другим параметром передається масив аргументів - в нашому випадку
	//це значення 1 та 2.

	//пхп викликає метод call і передає туди імя методу і передані параметри

	class B{
		function __toString(){
			return "Hello";
		}
	}

	$o = new B();
	echo $o;
	//тут пхп не може конвертувати обєкт в строку, і коли в нас є така спроба,
	//то перед тим, щоб видати таку помилку, пхп шукає метод __toString

	//тут завжди просить, щоб поверталось стрінгове значення
?>