<?php
	function __autoload($name){
	//якщо пхп не може знайти будь-якого класу
	//то він, перед тим, як видати відповідну помилку
	//шукає функцію __autoload, передаючи туди
	//ім'я цього незнайденого класу як параметр'
		echo "Шукаєм клас $name";
	}
	$o = new A();

	//-----також можна інклудити файли в автолоаді

	// function __autoload($name){
	// 	include "$name.test2.php";
	// }

	// $a = new A();

	//тут діє наступний алгоритм, є звернення до неіснуючого класу
	//але перед тим як видати помилку, пхп звертається до autoload
	//там він бачить проінклудений файл, в якому є описаний цей клас
	//відповідно файл фактично виходить оголошеним!
?>