<?
//---------concatenation
	$a = 5;   $b = "Моя ";
	$a .= 6;  $c = "Україна";
			  $b .= $c;
	echo $a."<br>".$b;

//--Не можна починати змінні із цифр, лише букви або "_"
	$1a;

//---додавання символів до змінної
      $c = 'apple';

      echo "We have 3 $c<br>";
      echo "We have 3 {$c}s";

//---Керуючі послідовності в PHP
	//Якщо строка заключена в подвійні кавички, PHP розпізнає керуючі послідовності 
	//для спеціальних символів, за допомогою екрануючого слешу
	//\n новая строка
	//\r возврат каретки
	//\t горизонтальна табуляція (додає відступ Tab)
	//\\ обратная косая черта
	//\$ знак доллара
	//\" двойная кавычка

//----Вивід системної інформації
        phpinfo ();

//----Коментарі php
	// однорядковий коментар
	# однорядковий коментар
	/* багаторядковий 
	коментар */

//----Вивід часу
	echo date("d-m-Y")."<br>";
	echo strftime ('Сегодня %d-%m-%Y %l-%M-%S')."<br>";
	echo strftime ('Сегодня %d-%m-%Y %T');

//----Видалення змінної $x
	unset($x);

// Помилка рівня NOTICE
	//По замовчуванню значення стоїть - error_reporting = E_ALL & -NOTICE,
	//це означає, що компілятор відображає усі помилки крім рівня NOTICE -
	//це рівень необов'язкових помилок, наприклад робили виклик неоголошеної або видаленої функції.
	//Щоб включити вивід всіх помилок - error_reporting(E_ALL);
	//Щоб відключити вивід помилок - error_reporting(0);

//PHP на початок 2013 року підтримує 8 простих типів даних
	//Чотири скалярных типи:
	//- boolean
	//- integer
	//- float (число с плавающей точкой)
	//- string
	//Два змішаних типи:
	//- array
	//- object
	//Два спеціальних типи:
	//- resource
	//- NULL

//логічні змінні
	$foo = true;
	echo $foo;
	//при виводі false нам поверне значення пустої строки.

//Тип даних NULL
	//По своїй суті значення NULL представляє собою змінну без значення
	//Змінна вважається типом NULL у трьох випадках:
	//- їй не було присвоєно ніякого значення;
	//- їй була присвоєна константа NULL ($var = NULL);
	//- значення змінної було видалено з дороогою unset();

//звернення до елементів строки
	$str = 'This my life!';
	$str{strlen($str)-1}='?';
	echo $str;
	//Вивід: This my life?

//Група арифметичних операторів
	$a + $b - Сума $a і $b
	$a - $b - Різниця $a і $b
	$a * $b - Добуток $a і $b
	$a / $b - Частка $a на $b, 9/2=4.5
	$a % $b - Ділення по модулю, тобто повертає цілочисельний залишок від ділення, 8%3=2

//приведення типів
	$a = 'sddsds';
	$b = (int)$a;
	echo $b;

//Перетворення типів данних
	$x = '5';
	echo $x * 10; // 50, рахує зліва направо, поки не впреться в не цифру!!!
	$x = 'hello';
	echo $x * 10; // 0, при рахунку зліва направо, вперлось в букву 'h', яка є не цифрою, відповідно присвоїть строці значення '0';
	$x = '10hello';
	echo $x * 10; // 100, все згідно правила!!!
	$x = 's10hello';
	echo $x * 10; // 0, вперлось в не цифру 's', відповідно вся строка буде мати значення '0';

//Побітові оператори (оперують значеннями 0 і 1)
	//- $a & $b - оператор "і" - встановлює 1, коли два біти будуть одиниці (& - амперсант)
	//- $a | $b - оператор "або" - встановлює 1, коли хоча б один з бітів буде одиниця.
	//- $a ^ $b - "виключаюче або" - встановлює 1, коли хоча б один із бітів буде одиниця, але не обидва.
	//- ! $a - "заперечення" - унарний оператор, встановлює біт в протилежне значення.

//Константи
	//Константа корисна тим, що її не можна преоприділити як змінну, використовується для збереження 
	//важливих даних - паролі, дані доступу тощо:
    //define("COPYRIGHT","Оса великий");
    //define("COPYRIGHT","Оса маленький");
	//Константа буде мати значення "Оса великий", адже вона не може перевизначатися, відповідно 
	//друга строка просто буде ігноруватись!

	//Можемо зробити константу регістро-незалежною (додаємо 3 значення - "true");
	//define("CONSTANT", "Здравствуй, мир.", true);
	//Загальноприйняте називати константу у верхньому регістрі.

//Оператори порівняння
	$a == $b - Рівне - TRUE якщо $a рівне $b після перетворення типів.
	1 == 1 // true
	'1' == 1 // true (строку до числа приводить, у пхп число має пріоритет над строкою!)

	$a === $b - Строго рівне - TRUE якщо $a рівне $b і має однаковий тип.
	'1' == 1 // false (томущо різні типи)

	$a != $b - Не рівне - TRUE якщо $a не рівне $b після перетворення типів.

	$a !== $b - Строго не рівне - TRUE якщо $a не рівне $b + у випадку, якщо вони різних типів.

//Керуючі конструкції: if
	if (операнд 1) {виводиться, якщо операнд 1 = true}

//Керуючі конструкції: else
	if () {} else {}

//Тернарний оператор
	if ($shop)
	//тут пуста змінна, яка рівна 0
	echo "Иду в магазин";
	else
	echo "Иду в киоск";

	echo ($shop) ? "Иду в магазин" : "Иду в киоск"; //- Тенарний оператор

//Конструкція switch
	$i = 1; switch ($i) {
	case '0':
	echo "Результат: 0"; break;
	case '1':
	echo "Результат: 1"; break;
	case '2':
	echo "Результат: 2"; break;
	default:
	echo "Інше значення";}
	?>