<?
    function myCount(){
        $var = 1454;
        echo $var;
    }
    $b = myCount()*2; //виведе число, бо у функц. є конструкція echo
    echo $b; //виведе нуль, бо в значення функції нічого не передається
    //якщо у функцію додати return $var то тоді повернеться не 0, а число помножиться на 2.

//Особливості використання конструкції return.
        $a = NULL;
        function myCount($var){
                if(is_null($var))
                $var = 1454;
                return $var;
        }
        $b = myCount($a)*2;
        echo $b;

	// Висновки:
	// 1. Якби ми тут не використовували ні echo, ні return, компілятор 
	// би просто пробігав по нашій функції і нічого не виводив, таке хіба 
	// можна використовувати коли ми хочемо в цій функції переприсвоїти змінні тощо.
	// 2. При використанні  return $var, в нашій функції не виводиться 
	// а лише повертається (присвоєються індексу функції) значення, 
	// яке отримується згідно заданого алгоритму.
	// 3. Якби ми тут використовували замість return конструкцію echo то 
	// отримане значення не тільки б присвоювалося але і 
	// одразу виводилося, що не завжди потрібно....
?>
